###################################################################

# Created by write_sdc on Mon Jan  6 12:39:25 2025

###################################################################
set sdc_version 1.5

set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_wire_load_model -name tsmc18_wl10 -library slow
set_load -pin_load 0.002323 [get_ports halt]
set_load -pin_load 0.002323 [get_ports {mem_data[63]}]
set_load -pin_load 0.002323 [get_ports {mem_data[62]}]
set_load -pin_load 0.002323 [get_ports {mem_data[61]}]
set_load -pin_load 0.002323 [get_ports {mem_data[60]}]
set_load -pin_load 0.002323 [get_ports {mem_data[59]}]
set_load -pin_load 0.002323 [get_ports {mem_data[58]}]
set_load -pin_load 0.002323 [get_ports {mem_data[57]}]
set_load -pin_load 0.002323 [get_ports {mem_data[56]}]
set_load -pin_load 0.002323 [get_ports {mem_data[55]}]
set_load -pin_load 0.002323 [get_ports {mem_data[54]}]
set_load -pin_load 0.002323 [get_ports {mem_data[53]}]
set_load -pin_load 0.002323 [get_ports {mem_data[52]}]
set_load -pin_load 0.002323 [get_ports {mem_data[51]}]
set_load -pin_load 0.002323 [get_ports {mem_data[50]}]
set_load -pin_load 0.002323 [get_ports {mem_data[49]}]
set_load -pin_load 0.002323 [get_ports {mem_data[48]}]
set_load -pin_load 0.002323 [get_ports {mem_data[47]}]
set_load -pin_load 0.002323 [get_ports {mem_data[46]}]
set_load -pin_load 0.002323 [get_ports {mem_data[45]}]
set_load -pin_load 0.002323 [get_ports {mem_data[44]}]
set_load -pin_load 0.002323 [get_ports {mem_data[43]}]
set_load -pin_load 0.002323 [get_ports {mem_data[42]}]
set_load -pin_load 0.002323 [get_ports {mem_data[41]}]
set_load -pin_load 0.002323 [get_ports {mem_data[40]}]
set_load -pin_load 0.002323 [get_ports {mem_data[39]}]
set_load -pin_load 0.002323 [get_ports {mem_data[38]}]
set_load -pin_load 0.002323 [get_ports {mem_data[37]}]
set_load -pin_load 0.002323 [get_ports {mem_data[36]}]
set_load -pin_load 0.002323 [get_ports {mem_data[35]}]
set_load -pin_load 0.002323 [get_ports {mem_data[34]}]
set_load -pin_load 0.002323 [get_ports {mem_data[33]}]
set_load -pin_load 0.002323 [get_ports {mem_data[32]}]
set_load -pin_load 0.002323 [get_ports {mem_data[31]}]
set_load -pin_load 0.002323 [get_ports {mem_data[30]}]
set_load -pin_load 0.002323 [get_ports {mem_data[29]}]
set_load -pin_load 0.002323 [get_ports {mem_data[28]}]
set_load -pin_load 0.002323 [get_ports {mem_data[27]}]
set_load -pin_load 0.002323 [get_ports {mem_data[26]}]
set_load -pin_load 0.002323 [get_ports {mem_data[25]}]
set_load -pin_load 0.002323 [get_ports {mem_data[24]}]
set_load -pin_load 0.002323 [get_ports {mem_data[23]}]
set_load -pin_load 0.002323 [get_ports {mem_data[22]}]
set_load -pin_load 0.002323 [get_ports {mem_data[21]}]
set_load -pin_load 0.002323 [get_ports {mem_data[20]}]
set_load -pin_load 0.002323 [get_ports {mem_data[19]}]
set_load -pin_load 0.002323 [get_ports {mem_data[18]}]
set_load -pin_load 0.002323 [get_ports {mem_data[17]}]
set_load -pin_load 0.002323 [get_ports {mem_data[16]}]
set_load -pin_load 0.002323 [get_ports {mem_data[15]}]
set_load -pin_load 0.002323 [get_ports {mem_data[14]}]
set_load -pin_load 0.002323 [get_ports {mem_data[13]}]
set_load -pin_load 0.002323 [get_ports {mem_data[12]}]
set_load -pin_load 0.002323 [get_ports {mem_data[11]}]
set_load -pin_load 0.002323 [get_ports {mem_data[10]}]
set_load -pin_load 0.002323 [get_ports {mem_data[9]}]
set_load -pin_load 0.002323 [get_ports {mem_data[8]}]
set_load -pin_load 0.002323 [get_ports {mem_data[7]}]
set_load -pin_load 0.002323 [get_ports {mem_data[6]}]
set_load -pin_load 0.002323 [get_ports {mem_data[5]}]
set_load -pin_load 0.002323 [get_ports {mem_data[4]}]
set_load -pin_load 0.002323 [get_ports {mem_data[3]}]
set_load -pin_load 0.002323 [get_ports {mem_data[2]}]
set_load -pin_load 0.002323 [get_ports {mem_data[1]}]
set_load -pin_load 0.002323 [get_ports {mem_data[0]}]
set_load -pin_load 0.002323 [get_ports EX_MEM_mem_rw]
set_load -pin_load 0.002323 [get_ports {out_result[63]}]
set_load -pin_load 0.002323 [get_ports {out_result[62]}]
set_load -pin_load 0.002323 [get_ports {out_result[61]}]
set_load -pin_load 0.002323 [get_ports {out_result[60]}]
set_load -pin_load 0.002323 [get_ports {out_result[59]}]
set_load -pin_load 0.002323 [get_ports {out_result[58]}]
set_load -pin_load 0.002323 [get_ports {out_result[57]}]
set_load -pin_load 0.002323 [get_ports {out_result[56]}]
set_load -pin_load 0.002323 [get_ports {out_result[55]}]
set_load -pin_load 0.002323 [get_ports {out_result[54]}]
set_load -pin_load 0.002323 [get_ports {out_result[53]}]
set_load -pin_load 0.002323 [get_ports {out_result[52]}]
set_load -pin_load 0.002323 [get_ports {out_result[51]}]
set_load -pin_load 0.002323 [get_ports {out_result[50]}]
set_load -pin_load 0.002323 [get_ports {out_result[49]}]
set_load -pin_load 0.002323 [get_ports {out_result[48]}]
set_load -pin_load 0.002323 [get_ports {out_result[47]}]
set_load -pin_load 0.002323 [get_ports {out_result[46]}]
set_load -pin_load 0.002323 [get_ports {out_result[45]}]
set_load -pin_load 0.002323 [get_ports {out_result[44]}]
set_load -pin_load 0.002323 [get_ports {out_result[43]}]
set_load -pin_load 0.002323 [get_ports {out_result[42]}]
set_load -pin_load 0.002323 [get_ports {out_result[41]}]
set_load -pin_load 0.002323 [get_ports {out_result[40]}]
set_load -pin_load 0.002323 [get_ports {out_result[39]}]
set_load -pin_load 0.002323 [get_ports {out_result[38]}]
set_load -pin_load 0.002323 [get_ports {out_result[37]}]
set_load -pin_load 0.002323 [get_ports {out_result[36]}]
set_load -pin_load 0.002323 [get_ports {out_result[35]}]
set_load -pin_load 0.002323 [get_ports {out_result[34]}]
set_load -pin_load 0.002323 [get_ports {out_result[33]}]
set_load -pin_load 0.002323 [get_ports {out_result[32]}]
set_load -pin_load 0.002323 [get_ports {out_result[31]}]
set_load -pin_load 0.002323 [get_ports {out_result[30]}]
set_load -pin_load 0.002323 [get_ports {out_result[29]}]
set_load -pin_load 0.002323 [get_ports {out_result[28]}]
set_load -pin_load 0.002323 [get_ports {out_result[27]}]
set_load -pin_load 0.002323 [get_ports {out_result[26]}]
set_load -pin_load 0.002323 [get_ports {out_result[25]}]
set_load -pin_load 0.002323 [get_ports {out_result[24]}]
set_load -pin_load 0.002323 [get_ports {out_result[23]}]
set_load -pin_load 0.002323 [get_ports {out_result[22]}]
set_load -pin_load 0.002323 [get_ports {out_result[21]}]
set_load -pin_load 0.002323 [get_ports {out_result[20]}]
set_load -pin_load 0.002323 [get_ports {out_result[19]}]
set_load -pin_load 0.002323 [get_ports {out_result[18]}]
set_load -pin_load 0.002323 [get_ports {out_result[17]}]
set_load -pin_load 0.002323 [get_ports {out_result[16]}]
set_load -pin_load 0.002323 [get_ports {out_result[15]}]
set_load -pin_load 0.002323 [get_ports {out_result[14]}]
set_load -pin_load 0.002323 [get_ports {out_result[13]}]
set_load -pin_load 0.002323 [get_ports {out_result[12]}]
set_load -pin_load 0.002323 [get_ports {out_result[11]}]
set_load -pin_load 0.002323 [get_ports {out_result[10]}]
set_load -pin_load 0.002323 [get_ports {out_result[9]}]
set_load -pin_load 0.002323 [get_ports {out_result[8]}]
set_load -pin_load 0.002323 [get_ports {out_result[7]}]
set_load -pin_load 0.002323 [get_ports {out_result[6]}]
set_load -pin_load 0.002323 [get_ports {out_result[5]}]
set_load -pin_load 0.002323 [get_ports {out_result[4]}]
set_load -pin_load 0.002323 [get_ports {out_result[3]}]
set_load -pin_load 0.002323 [get_ports {out_result[2]}]
set_load -pin_load 0.002323 [get_ports {out_result[1]}]
set_load -pin_load 0.002323 [get_ports {out_result[0]}]
set_load -pin_load 0.002323 [get_ports {pc[31]}]
set_load -pin_load 0.002323 [get_ports {pc[30]}]
set_load -pin_load 0.002323 [get_ports {pc[29]}]
set_load -pin_load 0.002323 [get_ports {pc[28]}]
set_load -pin_load 0.002323 [get_ports {pc[27]}]
set_load -pin_load 0.002323 [get_ports {pc[26]}]
set_load -pin_load 0.002323 [get_ports {pc[25]}]
set_load -pin_load 0.002323 [get_ports {pc[24]}]
set_load -pin_load 0.002323 [get_ports {pc[23]}]
set_load -pin_load 0.002323 [get_ports {pc[22]}]
set_load -pin_load 0.002323 [get_ports {pc[21]}]
set_load -pin_load 0.002323 [get_ports {pc[20]}]
set_load -pin_load 0.002323 [get_ports {pc[19]}]
set_load -pin_load 0.002323 [get_ports {pc[18]}]
set_load -pin_load 0.002323 [get_ports {pc[17]}]
set_load -pin_load 0.002323 [get_ports {pc[16]}]
set_load -pin_load 0.002323 [get_ports {pc[15]}]
set_load -pin_load 0.002323 [get_ports {pc[14]}]
set_load -pin_load 0.002323 [get_ports {pc[13]}]
set_load -pin_load 0.002323 [get_ports {pc[12]}]
set_load -pin_load 0.002323 [get_ports {pc[11]}]
set_load -pin_load 0.002323 [get_ports {pc[10]}]
set_load -pin_load 0.002323 [get_ports {pc[9]}]
set_load -pin_load 0.002323 [get_ports {pc[8]}]
set_load -pin_load 0.002323 [get_ports {pc[7]}]
set_load -pin_load 0.002323 [get_ports {pc[6]}]
set_load -pin_load 0.002323 [get_ports {pc[5]}]
set_load -pin_load 0.002323 [get_ports {pc[4]}]
set_load -pin_load 0.002323 [get_ports {pc[3]}]
set_load -pin_load 0.002323 [get_ports {pc[2]}]
set_load -pin_load 0.002323 [get_ports {pc[1]}]
set_load -pin_load 0.002323 [get_ports {pc[0]}]
create_clock [get_ports clk]  -name CLK  -period 100  -waveform {50 100}
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[63]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[63]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[62]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[62]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[61]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[61]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[60]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[60]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[59]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[59]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[58]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[58]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[57]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[57]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[56]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[56]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[55]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[55]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[54]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[54]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[53]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[53]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[52]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[52]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[51]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[51]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[50]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[50]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[49]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[49]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[48]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[48]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[47]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[47]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[46]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[46]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[45]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[45]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[44]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[44]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[43]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[43]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[42]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[42]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[41]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[41]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[40]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[40]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[39]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[39]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[38]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[38]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[37]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[37]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[36]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[36]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[35]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[35]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[34]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[34]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[33]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[33]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[32]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[32]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[31]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[30]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[29]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[28]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[27]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[26]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[25]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[24]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[23]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[22]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[21]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[20]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[19]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[18]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[17]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[16]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[15]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[14]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[13]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[12]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[11]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[10]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[9]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[8]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[7]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[6]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[5]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[4]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[3]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[2]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[1]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {mem_data[0]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {mem_data[0]}]
set_input_delay -clock CLK  -max 1  [get_ports rst]
set_input_delay -clock CLK  -min 0.2  [get_ports rst]
set_input_delay -clock CLK  -max 1  [get_ports {inst[31]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[30]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[29]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[28]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[27]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[26]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[25]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[24]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[23]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[22]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[21]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[20]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[19]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[18]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[17]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[16]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[15]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[14]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[13]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[12]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[11]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[10]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[9]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[8]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[7]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[6]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[5]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[4]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[3]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[2]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[1]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {inst[0]}]
set_input_delay -clock CLK  -min 0.2  [get_ports {inst[0]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[63]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[63]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[62]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[62]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[61]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[61]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[60]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[60]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[59]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[59]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[58]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[58]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[57]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[57]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[56]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[56]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[55]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[55]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[54]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[54]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[53]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[53]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[52]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[52]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[51]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[51]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[50]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[50]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[49]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[49]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[48]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[48]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[47]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[47]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[46]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[46]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[45]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[45]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[44]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[44]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[43]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[43]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[42]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[42]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[41]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[41]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[40]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[40]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[39]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[39]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[38]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[38]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[37]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[37]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[36]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[36]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[35]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[35]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[34]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[34]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[33]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[33]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[32]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[32]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[31]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[31]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[30]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[30]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[29]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[29]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[28]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[28]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[27]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[27]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[26]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[26]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[25]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[25]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[24]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[24]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[23]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[23]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[22]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[22]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[21]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[21]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[20]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[20]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[19]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[19]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[18]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[18]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[17]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[17]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[16]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[16]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[15]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[15]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[14]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[14]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[13]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[13]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[12]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[12]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[11]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[11]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[10]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[10]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[9]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[9]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[8]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[8]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[7]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[7]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[6]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[6]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[5]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[5]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[4]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[4]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[3]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[3]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[2]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[2]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[1]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[1]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {mem_data[0]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {mem_data[0]}]
set_output_delay -clock CLK  -max 0.6  [get_ports halt]
set_output_delay -clock CLK  -min 0.3  [get_ports halt]
set_output_delay -clock CLK  -max 0.6  [get_ports EX_MEM_mem_rw]
set_output_delay -clock CLK  -min 0.3  [get_ports EX_MEM_mem_rw]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[63]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[63]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[62]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[62]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[61]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[61]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[60]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[60]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[59]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[59]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[58]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[58]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[57]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[57]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[56]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[56]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[55]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[55]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[54]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[54]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[53]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[53]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[52]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[52]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[51]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[51]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[50]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[50]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[49]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[49]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[48]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[48]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[47]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[47]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[46]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[46]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[45]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[45]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[44]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[44]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[43]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[43]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[42]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[42]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[41]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[41]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[40]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[40]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[39]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[39]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[38]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[38]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[37]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[37]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[36]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[36]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[35]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[35]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[34]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[34]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[33]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[33]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[32]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[32]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[31]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[31]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[30]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[30]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[29]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[29]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[28]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[28]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[27]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[27]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[26]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[26]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[25]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[25]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[24]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[24]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[23]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[23]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[22]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[22]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[21]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[21]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[20]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[20]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[19]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[19]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[18]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[18]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[17]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[17]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[16]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[16]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[15]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[15]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[14]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[14]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[13]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[13]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[12]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[12]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[11]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[11]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[10]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[10]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[9]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[9]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[8]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[8]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[7]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[7]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[6]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[6]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[5]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[5]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[4]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[4]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[3]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[3]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[2]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[2]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[1]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[1]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {out_result[0]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {out_result[0]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[31]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[31]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[30]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[30]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[29]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[29]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[28]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[28]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[27]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[27]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[26]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[26]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[25]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[25]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[24]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[24]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[23]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[23]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[22]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[22]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[21]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[21]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[20]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[20]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[19]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[19]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[18]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[18]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[17]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[17]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[16]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[16]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[15]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[15]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[14]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[14]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[13]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[13]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[12]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[12]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[11]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[11]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[10]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[10]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[9]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[9]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[8]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[8]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[7]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[7]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[6]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[6]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[5]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[5]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[4]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[4]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[3]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[3]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[2]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[2]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[1]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[1]}]
set_output_delay -clock CLK  -max 0.6  [get_ports {pc[0]}]
set_output_delay -clock CLK  -min 0.3  [get_ports {pc[0]}]
set_drive 3.41783  [get_ports {mem_data[63]}]
set_drive 3.41783  [get_ports {mem_data[62]}]
set_drive 3.41783  [get_ports {mem_data[61]}]
set_drive 3.41783  [get_ports {mem_data[60]}]
set_drive 3.41783  [get_ports {mem_data[59]}]
set_drive 3.41783  [get_ports {mem_data[58]}]
set_drive 3.41783  [get_ports {mem_data[57]}]
set_drive 3.41783  [get_ports {mem_data[56]}]
set_drive 3.41783  [get_ports {mem_data[55]}]
set_drive 3.41783  [get_ports {mem_data[54]}]
set_drive 3.41783  [get_ports {mem_data[53]}]
set_drive 3.41783  [get_ports {mem_data[52]}]
set_drive 3.41783  [get_ports {mem_data[51]}]
set_drive 3.41783  [get_ports {mem_data[50]}]
set_drive 3.41783  [get_ports {mem_data[49]}]
set_drive 3.41783  [get_ports {mem_data[48]}]
set_drive 3.41783  [get_ports {mem_data[47]}]
set_drive 3.41783  [get_ports {mem_data[46]}]
set_drive 3.41783  [get_ports {mem_data[45]}]
set_drive 3.41783  [get_ports {mem_data[44]}]
set_drive 3.41783  [get_ports {mem_data[43]}]
set_drive 3.41783  [get_ports {mem_data[42]}]
set_drive 3.41783  [get_ports {mem_data[41]}]
set_drive 3.41783  [get_ports {mem_data[40]}]
set_drive 3.41783  [get_ports {mem_data[39]}]
set_drive 3.41783  [get_ports {mem_data[38]}]
set_drive 3.41783  [get_ports {mem_data[37]}]
set_drive 3.41783  [get_ports {mem_data[36]}]
set_drive 3.41783  [get_ports {mem_data[35]}]
set_drive 3.41783  [get_ports {mem_data[34]}]
set_drive 3.41783  [get_ports {mem_data[33]}]
set_drive 3.41783  [get_ports {mem_data[32]}]
set_drive 3.41783  [get_ports {mem_data[31]}]
set_drive 3.41783  [get_ports {mem_data[30]}]
set_drive 3.41783  [get_ports {mem_data[29]}]
set_drive 3.41783  [get_ports {mem_data[28]}]
set_drive 3.41783  [get_ports {mem_data[27]}]
set_drive 3.41783  [get_ports {mem_data[26]}]
set_drive 3.41783  [get_ports {mem_data[25]}]
set_drive 3.41783  [get_ports {mem_data[24]}]
set_drive 3.41783  [get_ports {mem_data[23]}]
set_drive 3.41783  [get_ports {mem_data[22]}]
set_drive 3.41783  [get_ports {mem_data[21]}]
set_drive 3.41783  [get_ports {mem_data[20]}]
set_drive 3.41783  [get_ports {mem_data[19]}]
set_drive 3.41783  [get_ports {mem_data[18]}]
set_drive 3.41783  [get_ports {mem_data[17]}]
set_drive 3.41783  [get_ports {mem_data[16]}]
set_drive 3.41783  [get_ports {mem_data[15]}]
set_drive 3.41783  [get_ports {mem_data[14]}]
set_drive 3.41783  [get_ports {mem_data[13]}]
set_drive 3.41783  [get_ports {mem_data[12]}]
set_drive 3.41783  [get_ports {mem_data[11]}]
set_drive 3.41783  [get_ports {mem_data[10]}]
set_drive 3.41783  [get_ports {mem_data[9]}]
set_drive 3.41783  [get_ports {mem_data[8]}]
set_drive 3.41783  [get_ports {mem_data[7]}]
set_drive 3.41783  [get_ports {mem_data[6]}]
set_drive 3.41783  [get_ports {mem_data[5]}]
set_drive 3.41783  [get_ports {mem_data[4]}]
set_drive 3.41783  [get_ports {mem_data[3]}]
set_drive 3.41783  [get_ports {mem_data[2]}]
set_drive 3.41783  [get_ports {mem_data[1]}]
set_drive 3.41783  [get_ports {mem_data[0]}]
set_drive 3.41783  [get_ports clk]
set_drive 3.41783  [get_ports rst]
set_drive 3.41783  [get_ports {inst[31]}]
set_drive 3.41783  [get_ports {inst[30]}]
set_drive 3.41783  [get_ports {inst[29]}]
set_drive 3.41783  [get_ports {inst[28]}]
set_drive 3.41783  [get_ports {inst[27]}]
set_drive 3.41783  [get_ports {inst[26]}]
set_drive 3.41783  [get_ports {inst[25]}]
set_drive 3.41783  [get_ports {inst[24]}]
set_drive 3.41783  [get_ports {inst[23]}]
set_drive 3.41783  [get_ports {inst[22]}]
set_drive 3.41783  [get_ports {inst[21]}]
set_drive 3.41783  [get_ports {inst[20]}]
set_drive 3.41783  [get_ports {inst[19]}]
set_drive 3.41783  [get_ports {inst[18]}]
set_drive 3.41783  [get_ports {inst[17]}]
set_drive 3.41783  [get_ports {inst[16]}]
set_drive 3.41783  [get_ports {inst[15]}]
set_drive 3.41783  [get_ports {inst[14]}]
set_drive 3.41783  [get_ports {inst[13]}]
set_drive 3.41783  [get_ports {inst[12]}]
set_drive 3.41783  [get_ports {inst[11]}]
set_drive 3.41783  [get_ports {inst[10]}]
set_drive 3.41783  [get_ports {inst[9]}]
set_drive 3.41783  [get_ports {inst[8]}]
set_drive 3.41783  [get_ports {inst[7]}]
set_drive 3.41783  [get_ports {inst[6]}]
set_drive 3.41783  [get_ports {inst[5]}]
set_drive 3.41783  [get_ports {inst[4]}]
set_drive 3.41783  [get_ports {inst[3]}]
set_drive 3.41783  [get_ports {inst[2]}]
set_drive 3.41783  [get_ports {inst[1]}]
set_drive 3.41783  [get_ports {inst[0]}]
